keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxSbcu_regdef.h
/** \\brief  Arbiter Priority Register High */
typedef struct _Ifx_SBCU_PRIOH_Bits
{
    unsigned int CPU1:4;                    /**< \brief [3:0] Master 8 Priority (rw) */
    unsigned int CPU2:4;                    /**< \brief [7:4] Master 9 Priority (rw) */
    unsigned int RESERVEDA:4;               /**< \brief [11:8] Reserved (rw) */
    unsigned int RESERVEDB:4;               /**< \brief [15:12] Reserved (rw) */
    unsigned int HSMRMI:4;                  /**< \brief [19:16] Master 12 Priority (rw) */
    unsigned int HSMCMI:4;                  /**< \brief [23:20] Master 13 Priority (rw) */
    unsigned int RESERVEDE:4;               /**< \brief [27:24] Reserved (rw) */
    unsigned int DMAL:4;                    /**< \brief [31:28] Master 15 PriorityIncluding DMA transactions from DMA channels with low priority. Including Cerberus transactions with IOCONF.FPI_PRIO=¥0¥. (rw) */
} Ifx_SBCU_PRIOH_Bits;

/** \\brief  Arbiter Priority Register Low */
typedef struct _Ifx_SBCU_PRIOL_Bits
{
    unsigned int DMAH:4;                    /**< \brief [3:0] Master 0 PriorityIncluding DMA transactions from DMA channels with high priority. Including Cerberus transactions with IOCONF.FPI_PRIO=¥1¥. (rw) */
    unsigned int RESERVED1:4;               /**< \brief [7:4] Reserved (rw) */
    unsigned int ETH:4;                     /**< \brief [11:8] Master 2 Priority (rw) */
    unsigned int HSSL:4;                    /**< \brief [15:12] Master 3 Priority (rw) */
    unsigned int RESERVED4:4;               /**< \brief [19:16] Reserved (rw) */
    unsigned int DMAM:4;                    /**< \brief [23:20] Master 5 PriorityIncluding DMA transactions from DMA channels with medium priority. (rw) */
    unsigned int RESERVED6:4;               /**< \brief [27:24] Reserved (rw) */
    unsigned int CPU0:4;                    /**< \brief [31:28] Master 7 Priority (rw) */
} Ifx_SBCU_PRIOL_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Sbcu_union
 * \{  */

/** \\brief  Access Enable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SBCU_ACCEN0_Bits B;
} Ifx_SBCU_ACCEN0;

/** \\brief  Access Enable Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SBCU_ACCEN1_Bits B;
} Ifx_SBCU_ACCEN1;

/** \\brief  SBCU Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SBCU_CON_Bits B;
} Ifx_SBCU_CON;

/** \\brief  SBCU Debug Address 1 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SBCU_DBADR1_Bits B;
} Ifx_SBCU_DBADR1;

/** \\brief  SBCU Debug Address 2 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SBCU_DBADR2_Bits B;
} Ifx_SBCU_DBADR2;

/** \\brief  SBCU Debug Trapped Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SBCU_DBADRT_Bits B;
} Ifx_SBCU_DBADRT;

/** \\brief  SBCU Debug Bus Operation Signals Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SBCU_DBBOS_Bits B;
} Ifx_SBCU_DBBOS;

/** \\brief  SBCU Debug Trapped Bus Operation Signals Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SBCU_DBBOST_Bits B;
} Ifx_SBCU_DBBOST;

/** \\brief  SBCU Debug Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SBCU_DBCNTL_Bits B;
} Ifx_SBCU_DBCNTL;

/** \\brief  SBCU Debug Data Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SBCU_DBDAT_Bits B;
} Ifx_SBCU_DBDAT;

/** \\brief  SBCU Debug Trapped Master Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SBCU_DBGNTT_Bits B;
} Ifx_SBCU_DBGNTT;

/** \\brief  SBCU Debug Grant Mask Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SBCU_DBGRNT_Bits B;
} Ifx_SBCU_DBGRNT;

/** \\brief  SBCU Error Address Capture Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SBCU_EADD_Bits B;
} Ifx_SBCU_EADD;

/** \\brief  SBCU Error Control Capture Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SBCU_ECON_Bits B;
} Ifx_SBCU_ECON;

/** \\brief  SBCU Error Data Capture Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SBCU_EDAT_Bits B;
} Ifx_SBCU_EDAT;

/** \\brief  Module Identification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SBCU_ID_Bits B;
} Ifx_SBCU_ID;

